spoemb/linkit-v4-core/ports/nrf52840/core/hardware/smd_sat/smd_sat.cpp
void SmdSat::state_idle_pending_exit() {
	m_next_delay = SMDSAT_DELAY_STATE_TICK_MS;
}

void SmdSat::state_idle_pending() {
	TXTRACE("state_idle_pending: tick entered, calling ping() now");
	// Capture t0 AFTER the log above so the LFS commit time isn't counted in ping_ms.
	[[maybe_unused]] uint64_t ping_t0 = PMU::get_timestamp_ms();
	bool ping_ok = m_cmd.ping();
	[[maybe_unused]] unsigned int ping_ms = static_cast<unsigned>(PMU::get_timestamp_ms() - ping_t0);
	TXTRACE("state_idle_pending: ping() returned %s after %u ms",
	        ping_ok ? "OK" : "FAIL", ping_ms);
	if (ping_ok) {
		TXTRACE("state_idle_pending: ping OK (retries_left=%u) -> %s",
		        m_state_counter, is_kmac_profil_loaded ? "idle" : "load_kmac");
		// Small delay after ping ACK for STM32 DMA re-arm.
		// MAC readiness is verified in state_load_kmac (poll MAC_OK).
		nrf_delay_ms(10);
		// VPA stays LOW — only released just before TX (state_transmit_pending)
		if (!is_kmac_profil_loaded) {
			SMD_STATE_CHANGE(idle_pending, load_kmac);
		} else {
			SMD_STATE_CHANGE(idle_pending, idle);
		}
		return;
	}
	if (--m_state_counter == 0) {
		DEBUG_ERROR("SmdSat::%s: failed to enter IDLE state",__func__);
		SMD_STATE_CHANGE(idle_pending, error);
	} else {
		TXTRACE("state_idle_pending: ping FAIL, retry in %u ms (counter=%u)",
		        SMDSAT_DELAY_STATE_TICK_MS, m_state_counter);
		m_next_delay = SMDSAT_DELAY_STATE_TICK_MS;
	}
}

void SmdSat::state_idle_enter() {
	m_next_delay = SMDSAT_DELAY_TICK_INTERRUPT_MS;
	// Clamp ≥1: integer division of m_idle_timeout_ms / TICK_MS gives 0 when
	// idle_timeout < TICK_MS (10 ms). 0 then underflows on the first
	// --m_state_counter to UINT_MAX → idle effectively never times out, so
	// state_idle keeps re-scheduling until something external (packet arrival
	// or m_stopping) breaks the loop. Real callers pass 1 s default or
	// 35 s burst, so this is defense-in-depth against a future caller
	// passing a small or zero value.
	m_state_counter = m_idle_timeout_ms / SMDSAT_DELAY_TICK_INTERRUPT_MS;
	if (m_state_counter == 0) m_state_counter = 1;

	// If LPM allows STANDBY/SHUTDOWN, release wakeup pin LOW so SMD can
	// enter deep sleep while waiting for next TX in this session.
	//
	// IMPORTANT: in the normal send() path, m_packet_buffer is filled BEFORE
	// power_on() is called, so state_idle is transient (1 tick) — we go
	// straight to transmit_pending. Dropping WKUP here would let the STM32
	// start entering STANDBY, and raising it 10 ms later triggers a POR wake
	// (reset + firmware re-init ~100-200 ms) while we send SPI TX REQ
	// immediately → TX REQ fails. So only drop WKUP if the buffer is empty,
	// i.e. a real idle period (warm_up_for_tx-style pre-boot).
#ifdef SAT_EXTWAKEUP
	m_wkup_lowered = false;
	if ((m_lpm_mode & 0x18) && !m_packet_buffer.length()) {
		GPIOPins::clear(SAT_EXTWAKEUP);
		m_wkup_lowered = true;
		DEBUG_TRACE("SmdSat::%s: WKUP LOW (LPM=0x%02X, idle lingering)", __func__, m_lpm_mode);
	}
#endif
}

void SmdSat::state_idle_exit() {
	// Only raise WKUP + wait if we actually lowered it in state_idle_enter.
	// Avoids a pointless 50 ms delay (and spurious wake-up POR) in the
	// common transient-idle case where WKUP was never dropped.
#ifdef SAT_EXTWAKEUP
	if (m_wkup_lowered) {
		GPIOPins::set(SAT_EXTWAKEUP);
		nrf_delay_ms(50);  // STM32 wakeup from STANDBY/SHUTDOWN takes ~50ms (STANDBY).
		                   // SHUTDOWN needs more — user should not enable 0x10 without
		                   // also increasing this and re-running state_load_kmac (TCXO/LPM
		                   // are RAM registers lost on SHUTDOWN wake = full POR).
		m_wkup_lowered = false;
		DEBUG_TRACE("SmdSat::%s: WKUP HIGH (wakeup from LPM)", __func__);
	}
#endif
	m_next_delay = SMDSAT_DELAY_STATE_TICK_MS;
}

void SmdSat::state_idle() {
	if (m_packet_buffer.length()) {
		TXTRACE("state_idle: packet pending -> transmit_pending");
		m_tx_buffer = m_packet_buffer;
		m_packet_buffer.clear();
		SMD_STATE_CHANGE(idle, transmit_pending);
	} else if (m_stopping) {
		SMD_STATE_CHANGE(idle, stopped);
	} else {
		m_next_delay = SMDSAT_DELAY_TICK_INTERRUPT_MS;
		if (--m_state_counter == 0) {
			DEBUG_TRACE("SmdSat::%s: idle timeout elapsed",__func__);
			SMD_STATE_CHANGE(idle, stopped);
		}
		return;
	}

	// Mirror the clamp from state_idle_enter — same UINT_MAX underflow risk
	// when transitioning back to idle from a TX with a small idle_timeout.
	m_state_counter = m_idle_timeout_ms / SMDSAT_DELAY_TICK_INTERRUPT_MS;
	if (m_state_counter == 0) m_state_counter = 1;
}

void SmdSat::state_transmit_pending_enter() {
	m_state_counter = 3;
}

void SmdSat::state_transmit_pending_exit() {
	// First TX after power-on: warmup forced to 0 ONLY if the die is warm enough.
	// Cold die (deep cold dive then quick surface) keeps the configured warmup
	// to avoid an off-frequency first TX. Must match the gate logic in
	// state_load_kmac so the SMD's actual warmup matches our poll horizon.
	bool tcxo_skip = m_is_first_tx && (PMU::get_die_temperature_c() >= TCXO_SKIP_TEMP_THRESHOLD_C);
	unsigned int effective_warmup = tcxo_skip ? 0 : m_tcxo_warmup_time;
	unsigned int base_delay = (effective_warmup > 0) ? SMDSAT_DELAY_CMD_TX : smdsat_first_tx_base_delay_ms();
	m_next_delay = base_delay + (effective_warmup * 1000);
	TXTRACE("state_transmit_pending_exit: scheduling 1st TX poll in %u ms (first_tx=%u warmup=%u s)",
	        m_next_delay, m_is_first_tx, effective_warmup);
}

void SmdSat::state_transmit_pending() {
	if (m_tx_buffer.size()) {
		TXTRACE("state_transmit_pending: calling initiate_tx (%u bytes)",
		        static_cast<unsigned>(m_tx_buffer.size()));
		// Release VPA just before TX — PA regulator needs to be enabled for RF output
#ifdef SMD_VPA_PIN
		GPIOPins::release_to_highz(SMD_VPA_PIN);
		DEBUG_TRACE("SmdSat::%s: VPA released for TX", __func__);
#endif
		if (!m_cmd.initiate_tx(m_tx_buffer)) {
			DEBUG_ERROR("SmdSat::%s: initiate_tx failed, aborting TX", __func__);
			m_tx_buffer.clear();
			SMD_STATE_CHANGE(transmit_pending, error);
			return;
		}
		TXTRACE("state_transmit_pending: initiate_tx OK, TX started on STM32");
		notify(KineisEventTxStarted({}));
		SMD_STATE_CHANGE(transmit_pending, transmitting);
	} else if (--m_state_counter == 0) {
		DEBUG_ERROR("SmdSat::%s: failed accept SEND command",__func__);
		SMD_STATE_CHANGE(transmit_pending, error);
	} else {
		m_next_delay = SMDSAT_DELAY_STATE_TICK_MS;
	}
}

void SmdSat::state_transmitting_enter() {
	DEBUG_TRACE("SmdSat::%s", __func__);
	uint32_t total_timeout_ms = (m_tcxo_warmup_time * 1000) + 5000;
	m_state_counter = (total_timeout_ms / smdsat_timing_tx_poll_ms()) + 1;
#if SMDSAT_AUTOFALLBACK_ENABLED
	// Snapshot for cascade-failure detection in stop_send / power_off_immediate.
	m_initial_tx_state_counter = m_state_counter;
#endif
	DEBUG_TRACE("SmdSat::%s: poll timeout=%ums | counter=%u", __func__, total_timeout_ms, m_state_counter);
}

void SmdSat::state_transmitting_exit() {
	// First TX done: restore configured TCXO warmup on STM32 for subsequent TX
	// in this session. RAM register, lost on power cycle.
	if (m_is_first_tx && m_tcxo_warmup_time > 0) {
		try {
			m_cmd.write_tcxo_warmup(m_tcxo_warmup_time * 1000);
			DEBUG_TRACE("SmdSat::%s: restored TCXO warmup: %u s", __func__, m_tcxo_warmup_time);
		} catch (...) {
			DEBUG_WARN("SmdSat::%s: failed to restore TCXO warmup", __func__);
		}
	}
	m_is_first_tx = false;
	// Drive VPA LOW after TX — PA regulator no longer needed
#ifdef SMD_VPA_PIN
	GPIOPins::drive_low(SMD_VPA_PIN);
	DEBUG_TRACE("SmdSat::%s: VPA driven LOW after TX", __func__);
#endif
}

